# ApplicationName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UpdaterInfo..::..ApplicationName Property
UpdaterInfo Class See Also
---
Name of the application that owns the updater.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string ApplicationName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ApplicationName As String
	Get
```

Visual C++
---
```text
public:
property String^ ApplicationName {
	String^ get ();
}
```

# See Also
UpdaterInfo Class
Autodesk.Revit.DB Namespace